pkwasniok/avr-db-template/lib/atpack/edc/AVR32DU14.PIC
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW67" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1243"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW68" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1244"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW69" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1245"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW70" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1246"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW71" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1247"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW72" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1248"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW73" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1249"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW74" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x124A"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW75" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x124B"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW76" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x124C"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW77" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x124D"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW78" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x124E"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW79" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x124F"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW80" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1250"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW81" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1251"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW82" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1252"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW83" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1253"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW84" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1254"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW85" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1255"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW86" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1256"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW87" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1257"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW88" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1258"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW89" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1259"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW90" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x125A"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW91" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x125B"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW92" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x125C"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW93" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x125D"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW94" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x125E"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW95" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x125F"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW96" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1260"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW97" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1261"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW98" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1262"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW99" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1263"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW100" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1264"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW101" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1265"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW102" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1266"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW103" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1267"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW104" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1268"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW105" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1269"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW106" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x126A"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW107" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x126B"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW108" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x126C"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW109" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x126D"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW110" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x126E"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW111" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x126F"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW112" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1270"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW113" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1271"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW114" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1272"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW115" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1273"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW116" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1274"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW117" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1275"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW118" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1276"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW119" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1277"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW120" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1278"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW121" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1279"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW122" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x127A"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW123" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x127B"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW124" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x127C"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW125" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x127D"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW126" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x127E"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW127" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x127F"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW128" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1280"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW129" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1281"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW130" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1282"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW131" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1283"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW132" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1284"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW133" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1285"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW134" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1286"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW135" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1287"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW136" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1288"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW137" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1289"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW138" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x128A"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW139" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x128B"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW140" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x128C"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW141" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x128D"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW142" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x128E"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW143" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x128F"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW144" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1290"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW145" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1291"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW146" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1292"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW147" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1293"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW148" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1294"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW149" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1295"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW150" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1296"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW151" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1297"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW152" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1298"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW153" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1299"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW154" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x129A"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW155" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x129B"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW156" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x129C"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW157" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x129D"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW158" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x129E"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW159" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x129F"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW160" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12A0"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW161" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12A1"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW162" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12A2"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW163" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12A3"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW164" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12A4"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW165" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12A5"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW166" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12A6"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW167" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12A7"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW168" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12A8"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW169" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12A9"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW170" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12AA"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW171" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12AB"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW172" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12AC"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW173" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12AD"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW174" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12AE"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW175" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12AF"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW176" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12B0"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW177" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12B1"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW178" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12B2"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW179" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12B3"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW180" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12B4"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW181" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12B5"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW182" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12B6"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW183" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12B7"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW184" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12B8"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW185" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12B9"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW186" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12BA"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW187" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12BB"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW188" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12BC"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW189" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12BD"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW190" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12BE"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW191" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12BF"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW192" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12C0"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW193" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12C1"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW194" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12C2"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW195" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12C3"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW196" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12C4"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW197" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12C5"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW198" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12C6"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW199" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12C7"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW200" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12C8"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW201" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12C9"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW202" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12CA"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW203" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12CB"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW204" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12CC"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW205" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12CD"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW206" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12CE"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW207" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12CF"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW208" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12D0"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW209" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12D1"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW210" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12D2"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW211" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12D3"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW212" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12D4"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW213" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12D5"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW214" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12D6"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW215" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12D7"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW216" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12D8"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW217" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12D9"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW218" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12DA"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW219" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12DB"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW220" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12DC"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW221" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12DD"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW222" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12DE"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW223" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12DF"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW224" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12E0"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW225" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12E1"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW226" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12E2"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW227" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12E3"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW228" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12E4"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW229" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12E5"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW230" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12E6"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW231" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12E7"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW232" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12E8"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW233" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12E9"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW234" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12EA"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW235" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12EB"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW236" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12EC"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW237" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12ED"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW238" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12EE"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW239" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12EF"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW240" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12F0"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW241" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12F1"/>
